# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2026-05-19 12:53:50 krylon>
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Newsroom [51/52]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: all
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2026-05-19 Di 12:53]
   | Headline                                         | Time      |            |          |       |      |
   |--------------------------------------------------+-----------+------------+----------+-------+------|
   | *Total time*                                     | *5d 0:15* |            |          |       |      |
   |--------------------------------------------------+-----------+------------+----------+-------+------|
   | *Newsroom [51/52]*                               | *5d 0:15* |            |          |       |      |
   | \_  /Components [50/50]/                         |           | /4d 23:32/ |          |       |      |
   | \_    Model [3/3]                                |           |            |     4:39 |       |      |
   | \_      Plant a tree!                            |           |            |          |  0:25 |      |
   | \_      Strip HTML                               |           |            |          |  1:57 |      |
   | \_      Sanitize HTML                            |           |            |          |  1:26 |      |
   | \_    Database [3/3]                             |           |            |    17:12 |       |      |
   | \_      Bookmarks                                |           |            |          |  1:22 |      |
   | \_      Tags                                     |           |            |          |  1:37 |      |
   | \_        Tags form a hierarchy                  |           |            |          |       | 0:10 |
   | \_      TagLinks                                 |           |            |          |  2:23 |      |
   | \_      Search [1/1]                             |           |            |          |  8:07 |      |
   | \_        Search by Tags hierarchically          |           |            |          |       | 2:28 |
   | \_    Engine [1/1]                               |           |            |     4:16 |       |      |
   | \_    Blacklist [3/3]                            |           |            |     3:35 |       |      |
   | \_      Save and Sort Blacklist periodically     |           |            |          |  0:02 |      |
   | \_    Cache [2/2]                                |           |            |     3:20 |       |      |
   | \_      Evict expired values                     |           |            |          |  0:27 |      |
   | \_    Classifier [0/0]                           |           |            |     2:26 |       |      |
   | \_    Rating Guesser aka Critic [1/1]            |           |            |     9:40 |       |      |
   | \_      Testing                                  |           |            |          |  2:31 |      |
   | \_    Web [28/28]                                |           |            | 2d 12:03 |       |      |
   | \_      Menu [1/1]                               |           |            |          |  0:07 |      |
   | \_        Submenu for Analysis                   |           |            |          |       | 0:07 |
   | \_      Blacklist [2/2]                          |           |            |          |  3:19 |      |
   | \_        View and edit Blacklist                |           |            |          |       | 2:25 |
   | \_        Use Blacklist                          |           |            |          |       | 0:54 |
   | \_      Subscribe to Feeds                       |           |            |          |  3:03 |      |
   | \_      Manage Feeds                             |           |            |          |  2:45 |      |
   | \_      View for Tags                            |           |            |          |  4:02 |      |
   | \_      Manage Tags [4/4]                        |           |            |          | 12:30 |      |
   | \_        Create and edit Tags                   |           |            |          |       | 3:09 |
   | \_        Tag Items                              |           |            |          |       | 5:07 |
   | \_        Suggest Tags                           |           |            |          |       | 4:11 |
   | \_      Integrate Classifier                     |           |            |          |  2:37 |      |
   | \_        Retrain Classifier                     |           |            |          |       | 0:54 |
   | \_      Rate Items                               |           |            |          |  5:14 |      |
   | \_      Resize images                            |           |            |          |  0:17 |      |
   | \_      Search [3/3]                             |           |            |          | 13:23 |      |
   | \_        The curious case of the missing...     |           |            |          |       | 0:41 |
   | \_        Nicer UI for picking Tags              |           |            |          |       | 4:52 |
   | \_        Smoother UX                            |           |            |          |       | 0:39 |
   | \_      Suspend refresh                          |           |            |          |  1:32 |      |
   | \_      Bookmarks                                |           |            |          |  2:03 |      |
   | \_      Analysis [5/5]                           |           |            |          |  4:50 |      |
   | \_        Tags [0/0]                             |           |            |          |       | 1:30 |
   | \_        Caching                                |           |            |          |       | 0:16 |
   | \_        Choose time window                     |           |            |          |       | 0:08 |
   | \_        Add links for words that are Tags      |           |            |          |       | 0:20 |
   | \_        Trend analysis over longer periods,... |           |            |          |       | 2:21 |
   | \_    Trendy [8/8]                               |           |            |    14:16 |       |      |
   | \_      Trend analysis [0/0]                     |           |            |          |  0:54 |      |
   | \_      Changes                                  |           |            |          |  4:06 |      |
   | \_      Frequent words [5/5]                     |           |            |          |  9:15 |      |
   | \_        Embedded Stopwords                     |           |            |          |       | 2:25 |
   | \_        Use weights for Items marked as...     |           |            |          |       | 0:36 |
   | \_        Synonyms                               |           |            |          |       | 0:21 |
   | \_    build script [1/1]                         |           |            |     0:05 |       |      |
   | \_      Run nilaway sequentially                 |           |            |          |  0:05 |      |
   | \_  /Features [1/2]/                             |           | /0:43/     |          |       |      |
   | \_    Performance [1/1]                          |           |            |     0:42 |       |      |
   | \_      Profiler                                 |           |            |          |  0:24 |      |
   | \_    Analysis paralysis [0/0]                   |           |            |     0:01 |       |      |
   #+END:
** Components [50/50]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: all
   :END:
*** Model [3/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-05-02 Sa 14:22]--[2026-05-02 Sa 14:38] =>  0:16
    CLOCK: [2026-03-09 Mo 13:15]--[2026-03-09 Mo 13:50] =>  0:35
    :END:
**** CANCELLED Plant a tree!
     CLOSED: [2026-05-02 Sa 14:11]
     :LOGBOOK:
     CLOCK: [2026-05-02 Sa 13:46]--[2026-05-02 Sa 14:11] =>  0:25
     :END:
     I need to represent the Tag hierarchy as it is - a tree!

     [2026-05-02 Sa 14:09]
     I don't know what it is, but I cannot wrap my head around it. Brainfog.
**** DONE Strip HTML
     CLOSED: [2026-04-02 Do 13:15]
     :LOGBOOK:
     CLOCK: [2026-03-23 Mo 17:44]--[2026-03-23 Mo 18:03] =>  0:19
     CLOCK: [2026-03-23 Mo 14:55]--[2026-03-23 Mo 16:33] =>  1:38
     :END:
     In order to work with the Items in Rating and Tagging, I need to clean
     them up - strip all the HTML at the very least. Remove stopwords, stem the
     rest, etc.
**** DONE Sanitize HTML
     CLOSED: [2026-04-01 Mi 16:31]
     :LOGBOOK:
     CLOCK: [2026-04-01 Mi 15:05]--[2026-04-01 Mi 16:31] =>  1:26
     :END:
     For display in the Web UI, I would like to sanitize the Item Body on the
     server side (ideally caching the result), remove Javascript and such,
     resize images.
*** Database [3/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-14 Sa 13:24]--[2026-03-14 Sa 13:45] =>  0:21
    CLOCK: [2026-03-10 Di 13:25]--[2026-03-10 Di 13:44] =>  0:19
    CLOCK: [2026-03-10 Di 12:39]--[2026-03-10 Di 13:23] =>  0:44
    CLOCK: [2026-03-10 Di 08:28]--[2026-03-10 Di 09:00] =>  0:32
    CLOCK: [2026-03-09 Mo 15:13]--[2026-03-09 Mo 16:01] =>  0:48
    CLOCK: [2026-03-09 Mo 14:13]--[2026-03-09 Mo 14:55] =>  0:42
    CLOCK: [2026-03-09 Mo 13:50]--[2026-03-09 Mo 14:07] =>  0:17
    :END:
**** DONE Bookmarks
     CLOSED: [2026-05-04 Mo 12:56]
     :LOGBOOK:
     CLOCK: [2026-05-04 Mo 12:14]--[2026-05-04 Mo 12:56] =>  0:42
     CLOCK: [2026-05-03 So 15:41]--[2026-05-03 So 16:21] =>  0:40
     :END:
**** Tags
     :LOGBOOK:
     CLOCK: [2026-04-07 Di 12:50]--[2026-04-07 Di 13:08] =>  0:18
     CLOCK: [2026-04-02 Do 13:30]--[2026-04-02 Do 14:39] =>  1:09
     :END:
***** Tags form a hierarchy
      :LOGBOOK:
      CLOCK: [2026-04-01 Mi 13:36]--[2026-04-01 Mi 13:46] =>  0:10
      :END:
**** TagLinks
     :LOGBOOK:
     CLOCK: [2026-04-10 Fr 12:30]--[2026-04-10 Fr 12:37] =>  0:07
     CLOCK: [2026-04-09 Do 15:49]--[2026-04-09 Do 17:12] =>  1:23
     CLOCK: [2026-04-08 Mi 11:53]--[2026-04-08 Mi 12:46] =>  0:53
     :END:
**** DONE Search [1/1]
     CLOSED: [2026-05-02 Sa 13:06]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: all
     :END:
     :LOGBOOK:
     CLOCK: [2026-04-22 Mi 11:25]--[2026-04-22 Mi 12:36] =>  1:11
     CLOCK: [2026-04-21 Di 11:55]--[2026-04-21 Di 13:25] =>  1:30
     CLOCK: [2026-04-20 Mo 15:10]--[2026-04-20 Mo 15:59] =>  0:49
     CLOCK: [2026-04-20 Mo 14:04]--[2026-04-20 Mo 14:48] =>  0:44
     CLOCK: [2026-04-20 Mo 12:29]--[2026-04-20 Mo 13:54] =>  1:25
     :END:
     I would really like to delegate of much of the heavy lifting for the
     search to the database engine, because it is probably a lot faster than
     anything I could come up with.
     But the fact that searching by tags and period is optional complicates
     that significantly, unless I resort to generating SQL on the fly,
     something I would rather avoid.
     [2026-04-20 Mo 13:55]
     I think I found a solution that works well enough, but I need to test it.
     Since I have only four cases (with/without date/tag), I wrote SQL queries
     for each of those.
     [2026-04-20 Mo 14:04]
     I spoke prematurely, the way I handle tags is not working (I attempted
     passing in a slice of IDs, which is not supported). I'll have to rethink
     that part.
     [2026-04-20 Mo 15:09]
     There is a package named [[https://jmoiron.github.io/sqlx/][sqlx]] that helps with SQL queries using "IN (?)"
     parameters. This does break the way I deal with SQL queries throughout
     the database layer, but it does appear to work. At least in the sense of
     not breaking any tests or upsetting any linters.
***** DONE Search by Tags hierarchically
      CLOSED: [2026-05-02 Sa 13:06]
      :LOGBOOK:
      CLOCK: [2026-05-02 Sa 12:40]--[2026-05-02 Sa 13:06] =>  0:26
      CLOCK: [2026-05-01 Fr 11:04]--[2026-05-01 Fr 13:06] =>  2:02
      :END:
      This has been on my todo list for a *really* long time. I had this in
      mind from the very beginning, but I never got around to implementing it
      or even meditating on its implementation.

      [2026-05-01 Fr 11:33]
      Honestly, I think I can start by manually expanding the tag set before
      performing the query.
*** Engine [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-12 Do 13:50]--[2026-03-12 Do 14:05] =>  0:15
    CLOCK: [2026-03-12 Do 13:25]--[2026-03-12 Do 13:34] =>  0:09
    CLOCK: [2026-03-11 Mi 13:56]--[2026-03-11 Mi 15:49] =>  1:53
    CLOCK: [2026-03-10 Di 13:51]--[2026-03-10 Di 15:50] =>  1:59
    :END:
**** DONE Parse RSS/Atom
     CLOSED: [2026-03-12 Do 14:15]
     https://github.com/mmcdole/gofeed
*** Blacklist [3/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-04-13 Mo 12:12]--[2026-04-13 Mo 15:45] =>  3:33
    :END:
    I want to filter Items based on regular expressions, mainly to get rid of
    paywalled articles.
**** DONE Save and Sort Blacklist periodically
     CLOSED: [2026-04-18 Sa 21:17]
     :LOGBOOK:
     CLOCK: [2026-04-18 Sa 21:15]--[2026-04-18 Sa 21:17] =>  0:02
     :END:
     Huh, looks like I already took care of it. The Blacklist is sorted from
     the web UI when preparing the news view, and if there were any hits, it
     is saved as well.
**** DONE Persistence
     CLOSED: [2026-04-13 Mo 15:20]
     I need to decide how and where I want to store the blacklist
     items. BoltDB might be the most simple solution. OTOH, using the SQLite
     database I am using already would make it easier to inspect the blacklist
     or manipulate it manually.
     Then again, I don't want to put more load on the database than I have to.
     I could use something really primitive, too, a plain text file for
     example.
     I think, I will try BoltDB first, because it should give me good
     performance and is reasonably easy to use.
**** DONE Where to perform blacklisting?
     CLOSED: [2026-04-13 Mo 15:21]
     I could apply the blacklist when fetching new Items or when getting them
     from the database for displaying them.
     The first approach has a performance advantage, obviously, since I would
     have to filter Items only once.
     The second approach has the advantage that I can alter the blacklist
     later on. If I were to remove a pattern, Items that where skipped upon
     fetching them would remain lost. And adding patterns would not affect
     Items already in the database.

     So I will apply the filter when loading Items for display.
*** Cache [2/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-23 Mo 16:33]--[2026-03-23 Mo 17:42] =>  1:09
    CLOCK: [2026-03-18 Mi 12:50]--[2026-03-18 Mi 14:34] =>  1:44
    :END:
    I am trying to use Go generics so I can use the same code for several
    purposes. But I have very little experience with Go generics, so I expect
    some trouble.
**** CANCELLED Variable TTL
     CLOSED: [2026-05-07 Do 11:48]
**** DONE Evict expired values
     CLOSED: [2026-04-10 Fr 13:33]
     :LOGBOOK:
     CLOCK: [2026-04-10 Fr 13:06]--[2026-04-10 Fr 13:33] =>  0:27
     :END:
*** Classifier [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-04-10 Fr 13:34]--[2026-04-10 Fr 14:36] =>  1:02
    CLOCK: [2026-04-10 Fr 12:38]--[2026-04-10 Fr 13:06] =>  0:28
    CLOCK: [2026-04-09 Do 14:53]--[2026-04-09 Do 15:49] =>  0:56
    :END:
*** Rating Guesser aka Critic [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-30 Mo 18:18]--[2026-03-30 Mo 18:40] =>  0:22
    CLOCK: [2026-03-24 Di 14:57]--[2026-03-24 Di 16:37] =>  1:40
    CLOCK: [2026-03-23 Mo 18:17]--[2026-03-23 Mo 18:28] =>  0:11
    CLOCK: [2026-03-23 Mo 14:53]--[2026-03-23 Mo 14:55] =>  0:02
    CLOCK: [2026-03-22 So 16:37]--[2026-03-22 So 17:17] =>  0:40
    CLOCK: [2026-03-21 Sa 16:27]--[2026-03-21 Sa 16:54] =>  0:27
    CLOCK: [2026-03-19 Do 17:02]--[2026-03-19 Do 18:05] =>  1:03
    CLOCK: [2026-03-19 Do 15:08]--[2026-03-19 Do 15:31] =>  0:23
    CLOCK: [2026-03-18 Mi 12:33]--[2026-03-18 Mi 12:40] =>  0:07
    CLOCK: [2026-03-16 Mo 16:56]--[2026-03-16 Mo 19:10] =>  2:14
    :END:
**** CANCELLED Attempt replacing the RWMutex with a sync.Map
     CLOSED: [2026-05-07 Do 11:49]
**** Testing
     :LOGBOOK:
     CLOCK: [2026-03-30 Mo 18:45]--[2026-03-30 Mo 21:16] =>  2:31
     :END:
     Testing this is kind of tedious, at best, but I think I better put
     something in place ahead of time. In previous attempts at building an RSS
     reader, this part tended to burn through lots of CPU cycles, and one goal
     in this iteration is to make it more efficient. It should give acceptable
     performance on a Raspberry Pi Model 2, because that is what it is going
     to run on in my humble home.
*** Web [28/28]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-14 Sa 13:50]--[2026-03-14 Sa 14:44] =>  0:54
    CLOCK: [2026-03-14 Sa 12:21]--[2026-03-14 Sa 12:48] =>  0:27
    CLOCK: [2026-03-12 Do 14:50]--[2026-03-12 Do 17:26] =>  2:36
    CLOCK: [2026-03-12 Do 14:16]--[2026-03-12 Do 14:40] =>  0:24
    :END:
**** Settings [0/0]
     I would like to make some parameters configurable.
     - For the news view, the number of items that are displayed by default. I
       *can* set the number manually through the URL, but clicking the link in
       the menu defaults to 100 items.
     - Likewise, for the histogram, it would be nice if I could configure the
       number of words and the period to analyze by default.
**** Menu [1/1]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: all
     :END:
***** DONE Submenu for Analysis
      CLOSED: [2026-05-18 Mo 13:48]
      :LOGBOOK:
      CLOCK: [2026-05-18 Mo 13:41]--[2026-05-18 Mo 13:48] =>  0:07
      :END:
      I want a popup menu, like I have for subscribing to Feeds, for the link
      to Analyses.
**** DONE Blacklist [2/2]
     CLOSED: [2026-04-14 Di 14:32]
***** DONE View and edit Blacklist
      CLOSED: [2026-04-14 Di 13:38]
      :LOGBOOK:
      CLOCK: [2026-04-14 Di 12:39]--[2026-04-14 Di 13:38] =>  0:59
      CLOCK: [2026-04-13 Mo 15:50]--[2026-04-13 Mo 17:16] =>  1:26
      :END:
***** DONE Use Blacklist
      CLOSED: [2026-04-14 Di 14:32]
      :LOGBOOK:
      CLOCK: [2026-04-14 Di 13:38]--[2026-04-14 Di 14:32] =>  0:54
      :END:
**** DONE Subscribe to Feeds
     CLOSED: [2026-04-04 Sa 16:24]
     :LOGBOOK:
     CLOCK: [2026-04-04 Sa 14:57]--[2026-04-04 Sa 16:24] =>  1:27
     CLOCK: [2026-04-04 Sa 14:31]--[2026-04-04 Sa 14:57] =>  0:26
     CLOCK: [2026-04-02 Do 14:49]--[2026-04-02 Do 15:50] =>  1:01
     CLOCK: [2026-04-01 Mi 14:02]--[2026-04-01 Mi 14:11] =>  0:09
     :END:
**** DONE Manage Feeds
     CLOSED: [2026-04-07 Di 13:16]
     :LOGBOOK:
     CLOCK: [2026-04-04 Sa 16:52]--[2026-04-04 Sa 19:37] =>  2:45
     :END:
**** DONE View for Tags
     CLOSED: [2026-05-09 Sa 11:55]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY:
     :END:
     :LOGBOOK:
     CLOCK: [2026-05-09 Sa 11:31]--[2026-05-09 Sa 11:55] =>  0:24
     CLOCK: [2026-05-08 Fr 14:17]--[2026-05-08 Fr 17:55] =>  3:38
     :END:
**** DONE Manage Tags [4/4]
     CLOSED: [2026-04-13 Mo 12:11]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: all
     :END:
     :LOGBOOK:
     CLOCK: [2026-04-07 Di 13:16]--[2026-04-07 Di 13:19] =>  0:03
     :END:
***** DONE Create and edit Tags
      CLOSED: [2026-04-09 Do 14:11]
      :LOGBOOK:
      CLOCK: [2026-04-18 Sa 21:45]--[2026-04-18 Sa 22:20] =>  0:35
      CLOCK: [2026-04-07 Di 14:48]--[2026-04-07 Di 16:20] =>  1:32
      CLOCK: [2026-04-07 Di 13:19]--[2026-04-07 Di 14:21] =>  1:02
      :END:
****** SUSPENDED [#G] Rename Tags
       CLOSED: [2026-05-07 Do 11:49]
       In a previous incarnation of this app, I ran into trouble when trying
       to rename Tags, because the name was used in this Classifier.
       I proactively tackled this issue by using the stringified Tag ID
       instead of its name when training the Classifier. So it should be no
       problem to rename Tags.
***** DONE Tag Items
      CLOSED: [2026-04-09 Do 14:11]
      :LOGBOOK:
      CLOCK: [2026-04-09 Do 12:26]--[2026-04-09 Do 14:11] =>  1:45
      CLOCK: [2026-04-08 Mi 12:46]--[2026-04-08 Mi 16:03] =>  3:17
      CLOCK: [2026-04-08 Mi 11:48]--[2026-04-08 Mi 11:53] =>  0:05
      :END:
      /Adding/ Tags works, but displaying them does not, except in one case. I
      am unsure why this is, but I'm afraid I have spent my brain power for
      the day. So I shall look into this again tomorrow.
***** DONE Suggest Tags
      CLOSED: [2026-04-13 Mo 12:10]
      :LOGBOOK:
      CLOCK: [2026-04-11 Sa 12:05]--[2026-04-11 Sa 15:48] =>  3:43
      CLOCK: [2026-04-11 Sa 11:30]--[2026-04-11 Sa 11:44] =>  0:14
      CLOCK: [2026-04-10 Fr 14:58]--[2026-04-10 Fr 15:12] =>  0:14
      :END:
**** DONE Integrate Classifier
     CLOSED: [2026-03-31 Di 15:25]
     :LOGBOOK:
     CLOCK: [2026-03-31 Di 14:01]--[2026-03-31 Di 15:25] =>  1:24
     CLOCK: [2026-03-31 Di 13:40]--[2026-03-31 Di 13:59] =>  0:19
     :END:
***** DONE Retrain Classifier
      CLOSED: [2026-04-01 Mi 15:05]
      :LOGBOOK:
      CLOCK: [2026-04-01 Mi 14:11]--[2026-04-01 Mi 15:05] =>  0:54
      :END:
**** DONE Rate Items
     CLOSED: [2026-03-31 Di 13:39]
     :LOGBOOK:
     CLOCK: [2026-03-31 Di 13:17]--[2026-03-31 Di 13:39] =>  0:22
     CLOCK: [2026-03-16 Mo 14:21]--[2026-03-16 Mo 15:36] =>  1:15
     CLOCK: [2026-03-16 Mo 14:00]--[2026-03-16 Mo 14:20] =>  0:20
     CLOCK: [2026-03-14 Sa 14:58]--[2026-03-14 Sa 17:50] =>  2:52
     CLOCK: [2026-03-14 Sa 12:59]--[2026-03-14 Sa 13:24] =>  0:25
     :END:
**** CANCELLED [#F] Dark Mode?
     CLOSED: [2026-04-13 Mo 15:21]
     I switched my desktop to a dark theme the other day, after frowning upon
     those for a long time. And I gotta admit, I kind of like it.

     [2026-04-13 Mo 15:21] I have abandoned the dark side, and I no longer
     want a dark RSS reader.
**** DONE [#B] Resize images
     CLOSED: [2026-04-18 Sa 21:03]
     :LOGBOOK:
     CLOCK: [2026-04-18 Sa 20:46]--[2026-04-18 Sa 21:03] =>  0:17
     :END:
     I don't need to actually *resize* images, just fix the img tags to change
     the size at which the images are displayed. I have done this before, so
     it shouldn't be too much work.
**** DONE [#C] Search [3/3]
     CLOSED: [2026-05-05 Di 11:59]
     :LOGBOOK:
     CLOCK: [2026-05-01 Fr 10:15]--[2026-05-01 Fr 10:19] =>  0:04
     CLOCK: [2026-04-30 Do 11:43]--[2026-04-30 Do 12:17] =>  0:34
     CLOCK: [2026-04-22 Mi 12:45]--[2026-04-22 Mi 14:05] =>  1:20
     CLOCK: [2026-04-22 Mi 11:10]--[2026-04-22 Mi 11:24] =>  0:14
     CLOCK: [2026-04-21 Di 13:25]--[2026-04-21 Di 15:01] =>  1:36
     CLOCK: [2026-04-20 Mo 11:51]--[2026-04-20 Mo 12:29] =>  0:38
     CLOCK: [2026-04-19 So 00:25]--[2026-04-19 So 01:28] =>  1:03
     CLOCK: [2026-04-18 Sa 22:21]--[2026-04-19 So 00:03] =>  1:42
     :END:
     One of the big points of having tags, of course, is to use them for
     searching.
     I'm going to have to think about how to present them in the search
     form. I try to avoid using fancy stuff, but I might want to look into the
     jQuery-UI subproject, which provides lots of "widgets", which might
     include a combobox or something like it.
***** DONE The curious case of the missing search results
      CLOSED: [2026-05-01 Fr 11:00]
      :LOGBOOK:
      CLOCK: [2026-05-01 Fr 10:19]--[2026-05-01 Fr 11:00] =>  0:41
      :END:
      I still get far fewer search results - often none at all - than I should
      be getting. I'll attempt to figure out what is going wrong here.
***** DONE Nicer UI for picking Tags
      CLOSED: [2026-05-16 Sa 15:12]
      :LOGBOOK:
      CLOCK: [2026-05-16 Sa 12:33]--[2026-05-16 Sa 15:12] =>  2:39
      CLOCK: [2026-05-15 Fr 11:07]--[2026-05-15 Fr 13:20] =>  2:13
      :END:
      This is going to take some serious thinking.
      [2026-05-15 Fr 11:07] I think I am going to go with a menu, like in the
      tag selection for news Items, and display chosen Tags with
      delete-buttons next to that.
***** DONE Smoother UX
      CLOSED: [2026-05-16 Sa 15:12]
      :LOGBOOK:
      CLOCK: [2026-05-02 Sa 13:07]--[2026-05-02 Sa 13:46] =>  0:39
      :END:
      When selecting Tags, TagP should be set and cleared automatically.
      Likewise for date ranges.
**** DONE Suspend refresh
     CLOSED: [2026-04-30 Do 13:49]
     :LOGBOOK:
     CLOCK: [2026-04-30 Do 12:17]--[2026-04-30 Do 13:49] =>  1:32
     :END:
**** DONE Bookmarks
     CLOSED: [2026-05-05 Di 11:36]
     :LOGBOOK:
     CLOCK: [2026-05-05 Di 11:13]--[2026-05-05 Di 11:36] =>  0:23
     CLOCK: [2026-05-04 Mo 14:50]--[2026-05-04 Mo 15:11] =>  0:21
     CLOCK: [2026-05-04 Mo 14:15]--[2026-05-04 Mo 14:32] =>  0:17
     CLOCK: [2026-05-04 Mo 12:58]--[2026-05-04 Mo 13:57] =>  0:59
     CLOCK: [2026-05-02 Sa 14:16]--[2026-05-02 Sa 14:19] =>  0:03
     :END:
     I would like to bookmark Items.
**** Analysis [5/5]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY:
     :END:
     :LOGBOOK:
     CLOCK: [2026-05-19 Di 11:26]--[2026-05-19 Di 11:41] =>  0:15
     :END:
***** DONE Tags [0/0]
      CLOSED: [2026-05-18 Mo 15:24]
      :PROPERTIES:
      :COOKIE_DATA: todo recursive
      :VISIBILITY: all
      :END:
      :LOGBOOK:
      CLOCK: [2026-05-18 Mo 13:54]--[2026-05-18 Mo 15:24] =>  1:30
      :END:
      How about showing all the Tags that I have used in a given period? 🤔
      I do not currently track /when/ a Tag has been attached to an Item.
      I could just show the Tags that have been attached to Items from a given
      period?
***** DONE Caching
      CLOSED: [2026-05-13 Mi 11:42]
      :LOGBOOK:
      CLOCK: [2026-05-12 Di 12:09]--[2026-05-12 Di 12:25] =>  0:16
      :END:
      This is probably going to be rather resource-intensive, so it might be a
      good idea to cache aggressively where possible.
***** DONE Choose time window
      CLOSED: [2026-05-08 Fr 11:58]
      :LOGBOOK:
      CLOCK: [2026-05-08 Fr 11:50]--[2026-05-08 Fr 11:58] =>  0:08
      :END:
***** DONE Add links for words that are Tags
      CLOSED: [2026-05-08 Fr 13:02]
      :LOGBOOK:
      CLOCK: [2026-05-08 Fr 12:42]--[2026-05-08 Fr 13:02] =>  0:20
      :END:
***** DONE Trend analysis over longer periods, with graphics
      CLOSED: [2026-05-13 Mi 12:55]
      :LOGBOOK:
      CLOCK: [2026-05-13 Mi 11:43]--[2026-05-13 Mi 12:55] =>  1:12
      CLOCK: [2026-05-12 Di 11:29]--[2026-05-12 Di 12:03] =>  0:34
      CLOCK: [2026-05-11 Mo 13:16]--[2026-05-11 Mo 13:51] =>  0:35
      :END:
      I discovered go-echarts, and echarts.
      echarts is a Javascript library for rendering charts.
      go-echarts, as far as I can tell, is a go library to make integrating
      echarts into go's template system more convenient.
      ...
      But it is *far* too complex for me.
      [[https://github.com/Strubbl/go-chart][go-chart]] appears to be a nicer approach.
*** Trendy [8/8]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-05-05 Di 12:01]--[2026-05-05 Di 12:02] =>  0:01
    :END:
    I want to analyze the news I fetch. Maybe start by looking for trends.
    Automatically detecting that several Items refer to the same event would
    be really cool, too.
    [[github.com/james-bowman/nlp][nlp]] should be a good starting point.
**** DONE Trend analysis [0/0]
     CLOSED: [2026-05-13 Mi 13:04]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY:
     :END:
     :LOGBOOK:
     CLOCK: [2026-05-11 Mo 12:21]--[2026-05-11 Mo 13:15] =>  0:54
     :END:
     I would like to compute the frequencies over a series of Periods, then
     render a chart from that data somehow.
**** DONE Changes
     CLOSED: [2026-05-11 Mo 12:16]
     :LOGBOOK:
     CLOCK: [2026-05-11 Mo 10:47]--[2026-05-11 Mo 11:37] =>  0:50
     CLOCK: [2026-05-09 Sa 14:19]--[2026-05-09 Sa 15:37] =>  1:18
     CLOCK: [2026-05-09 Sa 12:19]--[2026-05-09 Sa 14:17] =>  1:58
     :END:
     Looking into how the most frequent words change over time would be
     interesting, too. At that point I might get to draw some charts, even.
     *FUUUUUUUCK* Due to some error in git, emacs, magit, or all of the above,
     I lost about two hours work. Now, I have to start over. *weeping emoji*
**** DONE Frequent words [5/5]
     CLOSED: [2026-05-08 Fr 13:01]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY:
     :END:
     :LOGBOOK:
     CLOCK: [2026-05-07 Do 10:35]--[2026-05-07 Do 10:50] =>  0:15
     CLOCK: [2026-05-06 Mi 13:00]--[2026-05-06 Mi 13:09] =>  0:09
     CLOCK: [2026-05-06 Mi 10:27]--[2026-05-06 Mi 12:56] =>  2:29
     CLOCK: [2026-05-05 Di 12:02]--[2026-05-05 Di 15:02] =>  3:00
     :END:
***** DONE Umlaute
      CLOSED: [2026-05-07 Do 11:27]
      I made some progress, but Go's regex engine treats German Umlaute as
      nonword-characters. Which results in, say, "Präsident" turning into "Pr"
      and "sident". I am not sure how to handle this.
***** DONE Noise words
      CLOSED: [2026-05-07 Do 11:27]
      Hacker News RSS body is just a link that says "Comments". So the most
      frequent word is ... "Comments".
***** DONE Embedded Stopwords
      CLOSED: [2026-05-07 Do 14:54]
      :LOGBOOK:
      CLOCK: [2026-05-07 Do 12:45]--[2026-05-07 Do 14:54] =>  2:09
      CLOCK: [2026-05-07 Do 12:09]--[2026-05-07 Do 12:25] =>  0:16
      :END:
      I think I should move from code generation to embedding the stopword
      lists.
***** DONE Use weights for Items marked as Interesting or Boring
      CLOSED: [2026-05-08 Fr 12:16]
      :LOGBOOK:
      CLOCK: [2026-05-08 Fr 12:00]--[2026-05-08 Fr 12:16] =>  0:16
      CLOCK: [2026-05-08 Fr 11:29]--[2026-05-08 Fr 11:49] =>  0:20
      :END:
      And for *Tags*, too!
***** DONE Synonyms
      CLOSED: [2026-05-08 Fr 12:39]
      :LOGBOOK:
      CLOCK: [2026-05-08 Fr 12:18]--[2026-05-08 Fr 12:39] =>  0:21
      :END:
      Some words should be treated as one, e.g. "US" and "USA". That is going
      to get a bit tricky, but I'll think of something.

      Do I want to edit the definitions for synonyms at runtime, via the web
      UI?
*** Main [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
*** build script [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
**** DONE Run nilaway sequentially
     CLOSED: [2026-05-05 Di 11:43]
     :LOGBOOK:
     CLOCK: [2026-05-05 Di 11:38]--[2026-05-05 Di 11:43] =>  0:05
     :END:
     Nilaway consumes *huge* quantities of RAM, I would like to not run it in
     parallel.
** Features [1/2]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: all
   :END:
*** TODO Performance [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-05-19 Di 12:18]--[2026-05-19 Di 12:36] =>  0:18
    :END:
    One reason to rewrite my news ticker *again*, in Go, was to achieve better
    performance. The program runs on a puny second generation Raspberry Pi, so
    performance is a serious consideration.
    I should do some profiling.
**** DONE Profiler
     CLOSED: [2026-05-13 Mi 13:58]
     :LOGBOOK:
     CLOCK: [2026-05-13 Mi 13:34]--[2026-05-13 Mi 13:58] =>  0:24
     :END:
     Go includes a profiler in the standard library, I just need to enable it,
     if needed.
     [2026-05-13 Mi 13:58] That was easy.
*** Rating
*** Tagging
*** Search
*** Analysis paralysis [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-05-05 Di 11:59]--[2026-05-05 Di 12:00] =>  0:01
    :END:
    One thing that just popped up in my mind is that I could attempt to
    analyze the headlines, e.g. the frequency of certain words per day, week
    or month? That could be fun.
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: all
   :END:
